# 成功登录
succ_data = {"user": "18829291885", "passwd": "123456fly", }

# 异常用例数据：密码为空/用户名为空/用户名不规范
datas = [{"user": "18829291885", "passwd": "", "check": "请输入密码"},
         {"user": "", "passwd": "123456fly", "check": "请输入手机号"},
         {"user": "1882929188", "passwd": "123456fly", "check": "请输入正确的手机号"}]

# 异常用例：密码错误/从未注册的账号
wrong_datas = [{"user": "18829291885", "passwd": "123456", "check": "帐号或密码错误"},
               {"user": "18829291885", "passwd": "123456", "check": "此账号没有经过授权，请联系管理员"},
               ]
